RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
/**
 *******************************************************************************
 * @file  hc32f4a0_can.c
 * @brief This file provides firmware functions to manage the CAN.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
   2020-08-10       Wuze            Refined CAN_GetStatusVal()
   2020-12-14       Wuze            1. Fixed a bug of CAN_TTC_TransData(); Refined CAN_SBTConfig()
                                    2. Modified comment of structure stc_can_bt_cfg_t
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_can.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_CAN CAN
 * @brief CAN Driver Library
 * @{
 */

#if (DDL_CAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup CAN_Local_Macros CAN Local Macros
 * @{
 */

/**
 * @defgroup CAN_Configuration_Bit_Mask CAN Configuration Bit Mask
 * @{
 */
#define CAN_LB_MODE_MSK                     (CAN_CFG_STAT_LBMI | CAN_CFG_STAT_LBME)
#define CAN_TRANS_MODE_MSK                  (CAN_CFG_STAT_TPSS | CAN_CFG_STAT_TSSS)
#define CAN_TTC_FLAG_CLR_MSK                (CAN_TTC_FLAG_TTI | CAN_TTC_FLAG_WTI)
/**
 * @}
 */

/**
 * @defgroup CAN_Register_Bit_Band CAN Register Bit Band
 * @{
 */
#define __BIT_BAND_BASE                     (0x42000000UL)
#define __PERIP_BASE                        (0x40000000UL)
#define __REG_OFS(regAddr)                  ((regAddr) - __PERIP_BASE)
#define __BIT_BAND_ADDR(regAddr, pos)       ((__REG_OFS(regAddr) << 5U) + ((uint32_t)(pos) << 2U) + __BIT_BAND_BASE)
#define BIT_BAND(regAddr, pos)              (*(__IO uint32_t *)__BIT_BAND_ADDR((regAddr), (pos)))
/**
 * @}
 */

/**
 * @defgroup CAN_Check_Parameters_Validity CAN check parameters validity
 * @{
 */
#define IS_CAN_UNIT(x)                                                         \
(   ((x) == M4_CAN1)                            ||                             \
    ((x) == M4_CAN2))

#define IS_CAN_SBT_SEG1(x)                                                     \
(   ((x) >= 2U)                                 &&                             \
    ((x) <= 65U))

#define IS_CAN_SBT_SEG2(x)                                                     \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 8U))

#define IS_CAN_FD_SBT_SEG2(x)                                                  \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 32U))

#define IS_CAN_SBT_SJW(x)                                                      \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 16U))

#define IS_CAN_SBT_PRESC(x)                                                    \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 256U))

#define IS_CAN_FBT_SEG1(x)                                                     \
(   ((x) >= 2U)                                 &&                             \
    ((x) <= 17U))

#define IS_CAN_FBT_SEG2(x)                                                     \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 8U))

#define IS_CAN_FBT_SJW(x)                                                      \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 8U))

#define IS_CAN_FBT_PRESC(x)                                                    \
(   ((x) >= 1U)                                 &&                             \
    ((x) <= 256U))

#define IS_CAN_SBT_PRIO_MODE(x)                                                \
(   ((x) == CAN_STB_PRIO_FIFO)                  ||                             \
    ((x) == CAN_STB_PRIO_ID))

#define IS_CAN_IDE(x)                                                          \
(   ((x) == 0U)                                 ||                             \
    ((x) == 1U))

#define IS_CAN_SELF_ACK_CMD(x)                                                 \
(   ((x) == CAN_SELF_ACK_DISABLE)               ||                             \
    ((x) == CAN_SELF_ACK_ENABLE))

#define IS_CAN_TB_TYPE(x)                                                      \
(   ((x) == CAN_BUF_PTB)                        ||                             \
    ((x) == CAN_BUF_STB))

#define IS_CAN_STB_TX_CTRL(x)                                                  \
(   ((x) == CAN_STB_TRANS_ALL)                  ||                             \
    ((x) == CAN_STB_TRANS_ONE))

#define IS_CAN_WORK_MODE(x)                                                    \
(   ((x) <= CAN_MODE_ELB_SILENT))

#define IS_CAN_TRANS_MODE(x)                                                   \
(   ((x) == CAN_TRANS_PTB_STB_AUTO_RETX)        ||                             \
    ((x) == CAN_TRANS_PTB_SSHOT)                ||                             \
    ((x) == CAN_TRANS_STB_SSHOT)                ||                             \
    ((x) == CAN_TRANS_PTB_STB_SSHOT))

#define IS_CAN_RB_STORE_SEL(x)                                                 \
(   ((x) == CAN_RB_STORE_CORRECT_DATA)          ||                             \
    ((x) == CAN_RB_STORE_ALL_DATA))

