RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
#define IS_CAN_RB_OVF_OP(x)                                                    \
(   ((x) == CAN_RB_OVF_SAVE_NEW)                ||                             \
    ((x) == CAN_RB_OVF_DISCARD_NEW))

#define IS_CAN_RBS_FULL_WARN_LIMIT(x)                                          \
(   ((x) >= CAN_RBS_WARN_LIMIT_MIN)             &&                             \
    ((x) <= CAN_RBS_WARN_LIMIT_MAX))

#define IS_CAN_ERR_WARN_LIMIT(x)                                               \
(   ((x) < 16U))

#define IS_CAN_AF_MSK_TYPE(x)                                                  \
(   ((x) == CAN_AF_MSK_STD_EXT)                 ||                             \
    ((x) == CAN_AF_MSK_STD)                     ||                             \
    ((x) == CAN_AF_MSK_EXT))

#define IS_CAN_1_BIT_MSK(x)                                                    \
(   ((x) != 0U)                                 &&                             \
    (((x) & ((x) - 1U)) == 0U))

#define IS_CAN_BIT_MSK(x, msk)                                                 \
(   ((x) != 0U)                                 &&                             \
    (((x) | (msk)) == (msk)))

#define IS_CAN_FD_MODE(x)                                                      \
(   ((x) == CAN_FD_MODE_BOSCH)                  ||                             \
    ((x) == CAN_FD_MODE_ISO_11898))

#define IS_CAN_FD_SSP(x)                                                       \
(   ((x) < 128U))

#define IS_CAN_TDC_CMD(x)                                                      \
(   ((x) == CAN_FD_TDC_DISABLE)                 ||                             \
    ((x) == CAN_FD_TDC_ENABLE))

#define IS_CAN_TTC_TB_MODE(x)                                                  \
(   ((x) == CAN_TTC_TB_MODE_NORMAL)             ||                             \
    ((x) == CAN_TTC_TB_MODE_PTR))

#define IS_CAN_TTC_TBS(x)                                                      \
(   ((x) <= CAN_TTC_TBS_STB3))

#define IS_CAN_TTC_TRIG_TYPE(x)                                                \
(   ((x) == CAN_TTC_TRIG_IMMED_TRIG)            ||                             \
    ((x) == CAN_TTC_TRIG_TIME_TRIG)             ||                             \
    ((x) == CAN_TTC_TRIG_SSHOT_TRANS_TRIG)      ||                             \
    ((x) == CAN_TTC_TRIG_TRANS_START_TRIG)      ||                             \
    ((x) == CAN_TTC_TRIG_TRANS_STOP_TRIG))

#define IS_CAN_TTC_NTU_PRESC(x)                                                \
(   ((x) == CAN_TTC_NTU_PRESC_1)                ||                             \
    ((x) == CAN_TTC_NTU_PRESC_2)                ||                             \
    ((x) == CAN_TTC_NTU_PRESC_4)                ||                             \
    ((x) == CAN_TTC_NTU_PRESC_8))

#define IS_CAN_TTC_TX_EN_WINDOW(x)                                             \
(   (x) <= 16U)

/**
 * @}
 */

/**
 * @defgroup CAN_Miscellaneous_Macros CAN Miscellaneous Macros
 * @{
 */
#define CAN_RBS_CNT                         (8U)                /*!< Each CAN unit has 8 receive buffer slots. */
#define CAN_RBS_WARN_LIMIT_MIN              (1U)
#define CAN_RBS_WARN_LIMIT_MAX              (CAN_RBS_CNT)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CAN_Global_Functions CAN Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified CAN peripheral according to the specified parameters
 *         in the stc_can_init_t type structure.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcInit               Pointer to a stc_can_init_t structure value that
 *                                      contains the configuration information for the CAN.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL
 */
en_result_t CAN_Init(M4_CAN_TypeDef *CANx, const stc_can_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
#ifdef __DEBUG
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enCANFDCmd));
        if (pstcInit->enCANFDCmd == Disable)
        {
            DDL_ASSERT(IS_CAN_SBT_SEG2(pstcInit->stcSBT.u32SEG2));
        }
        else
        {
            DDL_ASSERT(IS_CAN_FD_SBT_SEG2(pstcInit->stcSBT.u32SEG2));
        }
#endif
        /* Software reset. */
        CAN_SWReset(CANx);
        /* Defines slow bit time. */
        (void)CAN_SBTConfig(CANx, &pstcInit->stcSBT);
        /* Specifies STB priority mode. */
        CAN_SetSTBPrioMode(CANx, pstcInit->u8STBPrioMode);
        /* Configures acceptance filters. */
        (void)CAN_AFConfig(CANx, pstcInit->u16AFSel, pstcInit->pstcAFCfg);
        /* Configures CAN-FD if enabled. */
        CAN_FD_Cmd(CANx, Disable);
        if (pstcInit->enCANFDCmd == Enable)
        {
            (void)CAN_FD_Config(CANx, &pstcInit->stcFDCfg);
            CAN_FD_Cmd(CANx, Enable);
        }

        /* CAN bus enters normal communication mode. */
        CAN_EnterNormalComm(CANx);
        /* Specifies work mode. */
        CAN_SetWorkMode(CANx, pstcInit->u8WorkMode);
        /* Specifies transmission mode. */
        CAN_SetTransMode(CANx, pstcInit->u8TransMode);

        CAN_SetRBStoreSel(CANx, pstcInit->u8RBStoreSel);
        CAN_SetRBSWarnLimit(CANx, pstcInit->u8RBSWarnLimit);
        CAN_SetErrWarnLimit(CANx, pstcInit->u8ErrWarnLimit);
        /* Specifies the operation when receiving buffer overflow. */
        CAN_SetRBOvfOp(CANx, pstcInit->u8RBOvfOp);
        /* Enable acceptance filters that configured before. */
        SET_REG16_BIT(CANx->ACFEN, pstcInit->u16AFSel);

        /* Enable or disable self-ACK. */
        DDL_ASSERT(IS_CAN_SELF_ACK_CMD(pstcInit->u8SelfACKCmd));
        MODIFY_REG8(CANx->RCTRL, CAN_RCTRL_SACK, pstcInit->u8SelfACKCmd);

        /* Clear all status flags. */
        CAN_ClrStatus(CANx, CAN_FLAG_ALL);

