RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for CAN initialization structure. \
 *         Slow bit time configuration:
 *         Based on 40MHz CAN clock, TQ clock is CAN clock divided by 4. \
 *         Bit rate 500Kbps, 1 bit time is 20TQs, sample point is 80%.
 *         CAN-FD bit time configuration:
 *         Based on 40MHz CAN clock, TQ clock is CAN clock divided by 1. \
 *         Bit rate 2Mbps, 1 bit time is 20TQs, primary sample point is 80%, \
 *         secondary sample point is 80%.
 * @param  [in]  pstcInit               Pointer to a stc_can_init_t structure value that
 *                                      contains the configuration information for the CAN unit.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t CAN_StructInit(stc_can_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        pstcInit->u8WorkMode     = CAN_MODE_NORMAL;
        pstcInit->u8TransMode    = CAN_TRANS_PTB_STB_AUTO_RETX;
        pstcInit->u8STBPrioMode  = CAN_STB_PRIO_FIFO;
        pstcInit->u8RBSWarnLimit = 6U;
        pstcInit->u8ErrWarnLimit = 7U;
        pstcInit->u16AFSel       = CAN_AF1;
        pstcInit->u8RBStoreSel   = CAN_RB_STORE_CORRECT_DATA;
        pstcInit->u8RBOvfOp      = CAN_RB_OVF_DISCARD_NEW;
        pstcInit->u8SelfACKCmd   = CAN_SELF_ACK_DISABLE;
        pstcInit->pstcAFCfg      = NULL;
        /*
         * Synchronization Segment(SS): Fixed as 1TQ
         * Propagation Time Segment(PTS) and Phase Buffer Segment 1(PBS1): 15TQs
         * Phase Buffer Segment 2(PBS2): 4TQs
         *
         * Field 'S_SEG_1' in register CAN_SBT contains SS, PTS and PBS1.
         * Field 'S_SEG_2' in register CAN_SBT only contains PBS2.
         * Sample point = (SS + PTS + PBS1) / (SS + PTS + PBS1 + PBS2)
         *              = (1 + 15) / (1 + 15 + 4)
         *              = 80%.
         */
        pstcInit->stcSBT.u32SEG1 = 1U + 15U;
        pstcInit->stcSBT.u32SEG2 = 4U;
        pstcInit->stcSBT.u32SJW  = 2U;
        pstcInit->stcSBT.u32Prescaler = 4U;

        /*
         * Set enCANFDCmd as Enable if CAN-FD is needed.
         *
         * u8TDCCmd: Enalbe(CAN_FD_TDC_ENABLE) or disable(CAN_FD_TDC_DISABLE) transmitter delay compensation.
         * u8TDCSSP: The position(TQs) of secondary sample point.
         *
         * Primary sample point: u32SEG1 / (u32SEG1 + u32SEG2) = 80%
         * Secondary sample point: u8TDCSSP / (u32SEG1 + u32SEG2) = 80%
         */
        pstcInit->enCANFDCmd = Disable;
        (void)CAN_FD_StructInit(&pstcInit->stcFDCfg);

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the CAN peripheral. Reset the registers of the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval None
 */
void CAN_DeInit(M4_CAN_TypeDef *CANx)
{
    uint8_t i;

    DDL_ASSERT(IS_CAN_UNIT(CANx));

    CLEAR_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
    for (i=0U; i<2U; i++)
    {
        WRITE_REG8(CANx->CFG_STAT, 0x80U);
        WRITE_REG8(CANx->TCMD, 0x00U);
        WRITE_REG8(CANx->TCTRL, 0x90U);
        WRITE_REG8(CANx->RCTRL, 0x10U);
        WRITE_REG8(CANx->RTIE, 0xFEU);
        WRITE_REG8(CANx->RTIF, 0xFFU);
        WRITE_REG8(CANx->ERRINT, 0xD5U);
        WRITE_REG8(CANx->LIMIT, 0x1BU);
        WRITE_REG32(CANx->SBT, 0x01020203U);
        WRITE_REG32(CANx->FBT, 0x01020203U);
        WRITE_REG8(CANx->EALCAP, 0x00U);
        WRITE_REG8(CANx->TDC, 0x00U);
        WRITE_REG8(CANx->RECNT, 0x00U);
        WRITE_REG8(CANx->TECNT, 0x00U);
        WRITE_REG8(CANx->ACFCTRL, 0x00U);
        WRITE_REG8(CANx->ACFEN, 0x01U);
        WRITE_REG8(CANx->TBSLOT, 0x00U);
        WRITE_REG8(CANx->TTCFG, 0xD8U);
        WRITE_REG16(CANx->TRG_CFG, 0x00U);
        WRITE_REG16(CANx->TT_TRIG, 0x00U);
        WRITE_REG16(CANx->TT_WTRIG, 0x00U);
        SET_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
    }
}

/**
 * @brief  Software reset the specified CAN unit. \
           Software reset is a partial reset and CANNOT reset all registers. \
           Some registers need software reset before written.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval None
 */
void CAN_SWReset(M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    SET_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
}

/**
 * @brief  Set the CAN node to enter the normal communication mode.
 *         When this state is set, it takes 11 CAN bit time for this node to participate in communication.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval None
 */
void CAN_EnterNormalComm(M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    CLEAR_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_RESET);
}

/**
 * @brief  Specifies work mode for the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8WorkMode             Work mode of CAN.
 *                                      This parameter can be a value of @ref CAN_Work_Mode
 *   @arg  CAN_MODE_NORMAL:             Normal work mode.
 *   @arg  CAN_MODE_SILENT:             Silent work mode. Prohibit data transmission.
 *   @arg  CAN_MODE_ILB:                Internal loopback mode, just for self-test while developing.
 *   @arg  CAN_MODE_ELB:                External loopback mode, just for self-test while developing.
 *   @arg  CAN_MODE_ELB_SILENT:         External loppback silent mode, just for self-test while developing. \
 *                                      It is forbidden to respond to received frames and error frames, but data can be transmitted.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_SetWorkMode(M4_CAN_TypeDef *CANx, uint8_t u8WorkMode)
{
    uint8_t u8CFGSTAT = 0U;
    uint8_t u8TCMD    = 0U;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_WORK_MODE(u8WorkMode));

    switch (u8WorkMode)
    {
        case CAN_MODE_SILENT:
            u8TCMD    = CAN_TCMD_LOM;
            break;
        case CAN_MODE_ILB:
            u8CFGSTAT = CAN_CFG_STAT_LBMI;
            break;
        case CAN_MODE_ELB:
            u8CFGSTAT = CAN_CFG_STAT_LBME;
            break;
        case CAN_MODE_ELB_SILENT:
            u8TCMD    = CAN_TCMD_LOM;
            u8CFGSTAT = CAN_CFG_STAT_LBME;
            break;
        case CAN_MODE_NORMAL:
        default:
            break;
    }

    MODIFY_REG8(CANx->CFG_STAT, CAN_LB_MODE_MSK, u8CFGSTAT);
    MODIFY_REG8(CANx->TCMD, CAN_TCMD_LOM, u8TCMD);
}

/**
 * @brief  Specifies transmission mode for the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8TransMode            PTB/STB transmission mode.
 *                                      This parameter can be a value of @ref CAN_Trans_Mode
 *   @arg  CAN_TRANS_PTB_STB_AUTO_RETX: Both PTB and STB automatically retransmit.
 *   @arg  CAN_TRANS_PTB_SSHOT:         PTB single shot transmit.
 *   @arg  CAN_TRANS_STB_SSHOT:         STB single shot transmit.
 *   @arg  CAN_TRANS_PTB_STB_SSHOT:     STB and PTB both single shot transmit.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_SetTransMode(M4_CAN_TypeDef *CANx, uint8_t u8TransMode)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TRANS_MODE(u8TransMode));
    MODIFY_REG8(CANx->CFG_STAT, CAN_TRANS_MODE_MSK, u8TransMode);
}

/**
 * @brief  Specifies STB transmission priority mode for the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8STBPrioMode          STB transmission priority mode.
 *                                      This parameter can be a value of @ref CAN_STB_Priority_Mode
 *   @arg  CAN_STB_PRIO_FIFO:           Data first in first be transmitted.
 *   @arg  CAN_STB_PRIO_ID :            Data with smallest ID first be transmitted.
 * @retval None
 * @note Whatever the priority mode of STB is, PTB always has the highest priority.
 */
void CAN_SetSTBPrioMode(M4_CAN_TypeDef *CANx, uint8_t u8STBPrioMode)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_SBT_PRIO_MODE(u8STBPrioMode));
    MODIFY_REG8(CANx->TCTRL, CAN_TCTRL_TSMODE, u8STBPrioMode);
}

/**
 * @brief  Specifies the receive buffer store selection for specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8RBStoreSel           Receive buffer store selection.
 *                                      This parameter can be a value of @ref CAN_RB_Store_Selection
 *   @arg  CAN_RB_STORE_CORRECT_DATA:   Receive buffer stores correct data frames only.
 *   @arg  CAN_RB_STORE_ALL_DATA:       Receive buffer stores all data frames, includes error data.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_SetRBStoreSel(M4_CAN_TypeDef *CANx, uint8_t u8RBStoreSel)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_RB_STORE_SEL(u8RBStoreSel));
    MODIFY_REG8(CANx->RCTRL, CAN_RCTRL_RBALL, u8RBStoreSel);
}

/**
 * @brief  Specifies the operation when receiving buffer overflow.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8RBOvfOperation       Operation when receive buffer overflow.
 *                                      This parameter can be a value of @ref CAN_RB_Overflow_Operation
 *   @arg  CAN_RB_OVF_SAVE_NEW:         Saves the newly received data and the first received data will be overwritten.
 *   @arg  CAN_RB_OVF_DISCARD_NEW:      Discard the newly received data.
 * @retval None
 */
void CAN_SetRBOvfOp(M4_CAN_TypeDef *CANx, uint8_t u8RBOvfOperation)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_RB_OVF_OP(u8RBOvfOperation));
    MODIFY_REG8(CANx->RCTRL, CAN_RCTRL_ROM, u8RBOvfOperation);
}

/**
 * @brief  Enable or disable the specified interrupts of the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u32IntType             Interrupt type of CAN. Set this parameter to 0xFFFFFFFF to select all the interrupts of CAN.
 *                                      This parameter can be values of @ref CAN_Interrupt_Type
 *   @arg  CAN_INT_ERR_INT:             Register bit RTIE.EIE. Error interrupt.
 *   @arg  CAN_INT_STB_TRANS_OK:        Register bit RTIE.TSIE. Secondary transmit buffer was transmitted successfully.
 *   @arg  CAN_INT_PTB_TRANS_OK:        Register bit RTIE.TPIE. Primary transmit buffer was transmitted successfully.
 *   @arg  CAN_INT_RB_ALMOST_FULL:      Register bit RTIE.RAFIE. The number of filled RB slot is greater than or equal to the LIMIT.AFWL setting value.
 *   @arg  CAN_INT_RB_FIFO_FULL:        Register bit RTIE.RFIE. The FIFO of receive buffer is full.
 *   @arg  CAN_INT_RX_OVERRUN:          Register bit RTIE.ROIE. Receive buffers are full and there is a further message to be stored.
 *   @arg  CAN_INT_RX:                  Register bit RTIE.RIE. Received a valid data frame or remote frame.
 *   @arg  CAN_INT_BUS_ERR:             Register bit ERRINT.BEIE. Arbitration lost caused bus error
 *   @arg  CAN_INT_ARB_LOST:            Register bit ERRINT.ALIE. Arbitration lost.
 *   @arg  CAN_INT_ERR_PASSIVE:         Register bit ERRINT.EPIE. A change from error-passive to error-active or error-active to error-passive has occurred.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified interrupts.
 *   @arg  Disable:                     Disable the specified interrupts.
 * @retval None
 */
void CAN_IntCmd(M4_CAN_TypeDef *CANx, uint32_t u32IntType, en_functional_state_t enNewState)
{
    uint8_t u8RTIE;
    uint8_t u8ERRINT;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32IntType &= CAN_INT_ALL;
    u8RTIE      = (uint8_t)u32IntType;
    u8ERRINT    = (uint8_t)(u32IntType >> 8U);

    if (enNewState == Enable)
    {
        SET_REG8_BIT(CANx->RTIE, u8RTIE);
        SET_REG8_BIT(CANx->ERRINT, u8ERRINT);
    }
    else
    {
        CLEAR_REG8_BIT(CANx->RTIE, u8RTIE);
        CLEAR_REG8_BIT(CANx->ERRINT, u8ERRINT);
    }
}

/**
 * @brief  Configures slow bit timing(SBT).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcCfg                Pointer to a stc_can_bt_cfg_t structure value that
 *                                      contains the configuration information for SBT.
 *   @arg  u32SEG1:                     TQs of segment 1. Contains synchronization segment, \
 *                                      propagation time segment and phase buffer segment 1.
 *   @arg  u32SEG2:                     TQs of segment 2. Phase buffer segment 2.
 *   @arg  u32SJW:                      TQs of synchronization jump width.
 *   @arg  u32Prescaler:                Range [1, 256].
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 * @note 1. Restrictions: u32SEG1 >= u32SEG2 + 1, u32SEG2 >= u32SJW.
 * @note 2. TQ = u32Prescaler / CANClock.
 * @note 3. Slow bit time = (u32SEG1 + u32SEG2) * TQ.
 * @note 4. Call this function when CFG_STAT.RESET is 1.
 */
en_result_t CAN_SBTConfig(M4_CAN_TypeDef *CANx, const stc_can_bt_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
#ifdef __DEBUG
    uint32_t u32Addr;
    uint32_t u32BitPos = 0U;
#endif
    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));
        DDL_ASSERT(IS_CAN_SBT_SEG1(pstcCfg->u32SEG1));
        DDL_ASSERT(IS_CAN_SBT_SJW(pstcCfg->u32SJW));
        DDL_ASSERT(IS_CAN_SBT_PRESC(pstcCfg->u32Prescaler));
#ifdef __DEBUG
        if (CANx == M4_CAN2)
        {
            u32BitPos = 1U;
        }
        /* If CAN-FD enabled. */
        u32Addr = (uint32_t)&M4_PERIC->CAN_SYCTLREG;
        if (BIT_BAND(u32Addr, u32BitPos) == (uint32_t)Disable)
        {
            DDL_ASSERT(IS_CAN_SBT_SEG2(pstcCfg->u32SEG2));
        }
        else
        {
            DDL_ASSERT(IS_CAN_FD_SBT_SEG2(pstcCfg->u32SEG2));
        }
#endif
        WRITE_REG32(CANx->SBT, ((pstcCfg->u32SEG1 - 2U) | \
                                ((pstcCfg->u32SEG2 - 1U) << CAN_SBT_S_SEG_2_POS) | \
                                ((pstcCfg->u32SJW - 1U) << CAN_SBT_S_SJW_POS)    | \
                                ((pstcCfg->u32Prescaler - 1U) << CAN_SBT_S_PRESC_POS)));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get arbitration lost position of a frame.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval A uint8_t type value of arbitration lost position.
 */
uint8_t CAN_GetArbLostPos(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (READ_REG8_BIT(CANx->EALCAP, CAN_EALCAP_ALC));
}

/**
 * @brief  Get error type.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t value of error type. It's can be a value of @ref CAN_Error_Type
 *   @arg  CAN_ERR_NO:                  No error.
 *   @arg  CAN_ERR_BIT:                 Error is bit error.
 *   @arg  CAN_ERR_FORM:                Error is form error.
 *   @arg  CAN_ERR_STUFF:               Error is stuff error.
 *   @arg  CAN_ERR_ACK:                 Error is ACK error.
 *   @arg  CAN_ERR_CRC:                 Error is CRC error.
 *   @arg  CAN_ERR_OTHER:               Error is other error.
 */
uint8_t CAN_GetErrType(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (READ_REG8_BIT(CANx->EALCAP, CAN_EALCAP_KOER));
}

/**
 * @brief  Set receive buffer slots full warning limit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in] u8RBSWarnLimit:         Receive buffer slots full warning limit. Rang is [1, 8].
 *                                      Each CAN unit has 8 receive buffer slots. When the number of received frames \
 *                                      reaches the value specified by parameter 'u8RBSWarnLimit', register bit RTIF.RAFIF is set and \
 *                                      the interrupt occurred if it was enabled.
 * @retval None
 */
void CAN_SetRBSWarnLimit(M4_CAN_TypeDef *CANx, uint8_t u8RBSWarnLimit)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_RBS_FULL_WARN_LIMIT(u8RBSWarnLimit));

    u8RBSWarnLimit <<= CAN_LIMIT_AFWL_POS;
    MODIFY_REG8(CANx->LIMIT, CAN_LIMIT_AFWL, u8RBSWarnLimit);
}

/**
 * @brief  Set error warning limit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8ErrWarnLimit         Programmable error warning limit. Range is [0, 15].
 *                                      Error warning limit = (u8ErrWarnLimit + 1) * 8.
 * @retval None
 */
void CAN_SetErrWarnLimit(M4_CAN_TypeDef *CANx, uint8_t u8ErrWarnLimit)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_ERR_WARN_LIMIT(u8ErrWarnLimit));
    MODIFY_REG8(CANx->LIMIT, CAN_LIMIT_EWL, u8ErrWarnLimit);
}

/**
 * @brief  Get receive error count(REC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value of REC.
 */
uint8_t CAN_GetREC(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (CANx->RECNT);
}

/**
 * @brief  Get transmission error count(TEC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value of TEC.
 */
uint8_t CAN_GetTEC(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (CANx->TECNT);
}

/**
 * @brief  Clear receive error count(REC) and transmission error count(TEC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval None
 * @note Set CFG_STAT.BUSOFF to 1 to clear REC and TEC. ONLY for TEST mode!
 */
void CAN_ClrErrCount(M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    SET_REG8_BIT(CANx->CFG_STAT, CAN_CFG_STAT_BUSOFF);
}

/**
 * @brief  Configures acceptance filter. Set ID and ID mask for the specified acceptance filters.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u16AFSel               Acceptance filter enable bit.
 *                                      This parameter can be values of @ref CAN_AF
 *   @arg CAN_AF1 ~ CAN_AF16
 * @param  [in]  pstcAFCfg              Points to a stc_can_af_cfg_t structure type array which contains ID and ID mask
 *                                      values for the acceptance filters specified by parameter u16AFSel.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:      -u16AFSel == 0U.
 *                                     -pstcAFCfg == NULL.
 * @note Call this function when CFG_STAT.RESET is 1.
 */
en_result_t CAN_AFConfig(M4_CAN_TypeDef *CANx, uint16_t u16AFSel, const stc_can_af_cfg_t pstcAFCfg[])
{
    uint8_t u8AFAddr = 0U;
    uint8_t i = 0U;
    en_result_t enRet = ErrorInvalidParameter;

    if ((u16AFSel != 0U) && (pstcAFCfg != NULL))
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));

