RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
    return u32RetVal;
}

/**
 * @brief  Get status(full or empty) of transmit buffer.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value of status of transmit buffer. It's can be a value of @ref CAN_TB_Status
 *   @arg  CAN_TB_STAT_EMPTY:           TTCAN is disabled(TTEN == 0): STB is empty.
 *                                      TTCAN is disabled(TTEN == 1) and transmit buffer is specified by TBPTR and TTPTR(TTTBM == 1):
 *                                      PTB and STB are both empty.
 *   @arg  CAN_TB_STAT_LESS_HALF:       TTEN == 0: STB is not less than half full;
 *                                      TTEN == 1 && TTTBM == 1: PTB and STB are neither empty.
 *   @arg  CAN_TB_STAT_MORE_HALF:       TTEN == 0: STB is more than half full;
 *                                      TTEN == 1 && TTTBM == 1: reserved value.
 *   @arg  CAN_TB_STAT_FULL             TTEN == 0: STB is full;
 *                                      TTEN == 1 && TTTBM == 1: PTB and STB are both full.
 */
uint8_t CAN_GetTBFullStatus(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (READ_REG8_BIT(CANx->TCTRL, CAN_TCTRL_TSSTAT));
}

/**
 * @brief  Get status(full or empty) of receive buffer.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value of status of receive buffer. It's can be a value of @ref CAN_RB_Status
 *   @arg  CAN_RB_STAT_EMPTY:           Receive buffer(RB) is empty.
 *   @arg  CAN_RB_STAT_LESS_WARN_LIMIT: RB is not empty, but is less than almost full warning limit.
 *   @arg  CAN_RB_STAT_MORE_WARN_LIMIT: RB is not full, but is more than or equal to almost full warning limit.
 *   @arg  CAN_RB_STAT_FULL:            RB is full.
 */
uint8_t CAN_GetRBFullStatus(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (READ_REG8_BIT(CANx->TCTRL, CAN_RCTRL_RSTAT));
}

/**
 * @brief  Configures the specified CAN FD according to the specified parameters
 *         in the stc_can_fd_cfg_t type structure.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcCfg                Pointer to a stc_can_fd_cfg_t structure value that
 *                                      contains the configuration information for the CAN FD.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 * @note Call this function when CFG_STAT.RESET is 1.
 */
en_result_t CAN_FD_Config(M4_CAN_TypeDef *CANx, const stc_can_fd_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));
        DDL_ASSERT(IS_CAN_FD_MODE(pstcCfg->u8CANFDMode));
        DDL_ASSERT(IS_CAN_TDC_CMD(pstcCfg->u8TDCCmd));
        DDL_ASSERT(IS_CAN_FD_SSP(pstcCfg->u8TDCSSP));

        DDL_ASSERT(IS_CAN_FBT_SEG1(pstcCfg->stcFBT.u32SEG1));
        DDL_ASSERT(IS_CAN_FBT_SEG2(pstcCfg->stcFBT.u32SEG2));
        DDL_ASSERT(IS_CAN_FBT_SJW(pstcCfg->stcFBT.u32SJW));
        DDL_ASSERT(IS_CAN_FBT_PRESC(pstcCfg->stcFBT.u32Prescaler));

        /* Specifies CAN FD ISO mode. */
        MODIFY_REG8(CANx->TCTRL, CAN_TCTRL_FD_ISO, pstcCfg->u8CANFDMode);

        /*
         * Configures fast bit time.
         * Restrictions: u32SEG1 >= u32SEG2 + 1, u32SEG2 >= u32SJW.
         * TQ = u32Prescaler / CANClock.
         * Fast bit time = (u32SEG1 + u32SEG2) * TQ.
         */
        WRITE_REG32(CANx->FBT, ((pstcCfg->stcFBT.u32SEG1 - 2U) | \
                                ((pstcCfg->stcFBT.u32SEG2 - 1U) << CAN_FBT_F_SEG_2_POS) | \
                                ((pstcCfg->stcFBT.u32SJW - 1U) << CAN_FBT_F_SJW_POS)    | \
                                ((pstcCfg->stcFBT.u32Prescaler - 1U) << CAN_FBT_F_PRESC_POS)));

        /* Specifies the secondary sample point. Number of TQ. */
        MODIFY_REG8(CANx->TDC, CAN_TDC_SSPOFF, pstcCfg->u8TDCSSP);

        /* Enable or disable TDC. */
        MODIFY_REG8(CANx->TDC, CAN_TDC_TDCEN, pstcCfg->u8TDCCmd);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set a default value for the CAN FD configuration structure.
 *         Based on 40MHz CAN clock, TQ clock is CAN clock divided by 1. \
 *         Bit rate 2Mbps, 1 bit time is 20TQs, primary sample point is 80%, \
 *         secondary sample point is 80%.
 * @param  [in]  pstcCfg                Pointer to a stc_can_fd_cfg_t structure value that
 *                                      contains the configuration information for the CAN FD.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t CAN_FD_StructInit(stc_can_fd_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        /*
         * u8TDCCmd: Enalbe(CAN_FD_TDC_ENABLE) or disable(CAN_FD_TDC_DISABLE) transmitter delay compensation.
         * u8TDCSSP: The position(TQs) of secondary sample point.
         *
         * Primary sample point: u32SEG1 / (u32SEG1 + u32SEG2) = 80%
         * Secondary sample point: u8TDCSSP / (u32SEG1 + u32SEG2) = 80%
         *
         * u32SEG1:      TQs of segment 1. Contains synchronization segment, \
         *               propagation time segment and phase buffer segment 1.
         * u32SEG2:      TQs of segment 2. Phase buffer segment 2.
         * u32SJW:       TQs of synchronization jump width.
         * u32Prescaler: Range [1, 256].
         */
        pstcCfg->u8CANFDMode = CAN_FD_MODE_BOSCH;
        pstcCfg->u8TDCCmd    = CAN_FD_TDC_ENABLE;
        pstcCfg->u8TDCSSP    = 16U;
        pstcCfg->stcFBT.u32SEG1 = 1U + 15U;
        pstcCfg->stcFBT.u32SEG2 = 4U;
        pstcCfg->stcFBT.u32SJW  = 4U;
        pstcCfg->stcFBT.u32Prescaler = 1U;

