RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable CAN FD.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable CAN FD.
 *   @arg  Disable:                     Disable CAN FD.
 * @retval None
 */
void CAN_FD_Cmd(const M4_CAN_TypeDef *CANx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint32_t u32BitPos = 0U;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (CANx == M4_CAN2)
    {
        u32BitPos = 1U;
    }
    u32Addr = (uint32_t)&M4_PERIC->CAN_SYCTLREG;
    BIT_BAND(u32Addr, u32BitPos) = (uint32_t)enNewState;
}

/**
 * @brief  Set a default value for the CAN TTC(time-triggered communication) configuration structure.
 * @param  [in]  pstcCfg                Pointer to a stc_can_ttc_cfg_t structure value that
 *                                      contains the configuration information for the CAN TTC.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t CAN_TTC_StructInit(stc_can_ttc_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        pstcCfg->u8TransBufMode   = CAN_TTC_TB_MODE_PTR;
        pstcCfg->u8NTUPrescaler   = CAN_TTC_NTU_PRESC_1;
        pstcCfg->u32RefMsgIDE     = 0U;
        pstcCfg->u32RefMsgID      = 0x0U;
        pstcCfg->u16TrigType      = CAN_TTC_TRIG_SSHOT_TRANS_TRIG;
        pstcCfg->u16TxEnWindow    = 16U;
        pstcCfg->u16TxTrigTime    = 0xFFFFU;
        pstcCfg->u16WatchTrigTime = 0xFFFFU;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Configures the specified CAN TTC(time-triggered communication) according to the specified parameters
 *         in the stc_can_ttc_cfg_t type structure.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcCfg                Pointer to a stc_can_ttc_cfg_t structure value that
 *                                      contains the configuration information for the CAN TTC.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t CAN_TTC_Config(M4_CAN_TypeDef *CANx, const stc_can_ttc_cfg_t *pstcCfg)
{
    uint32_t u32RefMsgID;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));
        DDL_ASSERT(IS_CAN_TTC_TB_MODE(pstcCfg->u8TransBufMode));
        DDL_ASSERT(IS_CAN_TTC_NTU_PRESC(pstcCfg->u8NTUPrescaler));
        DDL_ASSERT(IS_CAN_IDE(pstcCfg->u32RefMsgIDE));
        DDL_ASSERT(IS_CAN_TTC_TRIG_TYPE(pstcCfg->u16TrigType));
        DDL_ASSERT(IS_CAN_TTC_TX_EN_WINDOW(pstcCfg->u16TxEnWindow));

        u32RefMsgID = pstcCfg->u32RefMsgID & ((uint32_t)(~CAN_REF_MSG_REF_IDE));

        /* Specifies transmission buffer mode. */
        MODIFY_REG8(CANx->TCTRL, CAN_TCTRL_TTTBM, pstcCfg->u8TransBufMode);
        /* Specifies Tx_Enable window and trigger type. */
        WRITE_REG16(CANx->TRG_CFG, ((((uint32_t)pstcCfg->u16TxEnWindow-1U) << CAN_TRG_CFG_TEW_POS) | pstcCfg->u16TrigType));
        /* Specifies ID of reference message and its extension bit. */
        WRITE_REG32(CANx->REF_MSG, (((pstcCfg->u32RefMsgIDE << CAN_REF_MSG_REF_IDE_POS) | u32RefMsgID)));
        /* Specifies transmission trigger time. */
        WRITE_REG16(CANx->TT_TRIG, pstcCfg->u16TxTrigTime);
        /* Specifies watch trigger time. */
        WRITE_REG16(CANx->TT_WTRIG, pstcCfg->u16WatchTrigTime);
        /* Specifies NTU prescaler. */
        WRITE_REG8(CANx->TTCFG, pstcCfg->u8NTUPrescaler);

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable time-triggered communication(TTC) of the specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable TTC.
 *   @arg  Disable:                     Disable TTC.
 * @retval None
 * @note Call this function when CFG_STAT.RESET is 0.
 */
void CAN_TTC_Cmd(M4_CAN_TypeDef *CANx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    u32Addr = (uint32_t)&CANx->TTCFG;
    BIT_BAND(u32Addr, CAN_TTCFG_TTEN_POS) = (uint32_t)enNewState;
}

/**
 * @brief  Specifies transmission buffer slot(TBS) which is going to be filled.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8SlotPtr              Transmit-trigger transmit buffer slot.
 *                                      This parameter can be a value of @ref CAN_TTC_TBS_Pointer
 *   @arg  CAN_TTC_TBS_PTB:             TBS pointer points to PTB.
 *   @arg  CAN_TTC_TBS_STB1:            TBS pointer points to STB slot 1.
 *   @arg  CAN_TTC_TBS_STB2:            TBS pointer points to STB slot 2.
 *   @arg  CAN_TTC_TBS_STB3:            TBS pointer points to STB slot 3.
 * @retval None
 */
void CAN_TTC_SetTBSToBeFilled(M4_CAN_TypeDef *CANx, uint8_t u8SlotPtr)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TTC_TBS(u8SlotPtr));
    MODIFY_REG8(CANx->TBSLOT, CAN_TBSLOT_TBPTR, u8SlotPtr);
}

/**
 * @brief  Marks the transmission buffer slot(TBS) as filled.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval None
 */
void CAN_TTC_SetTBSFilled(M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    SET_REG8_BIT(CANx->TBSLOT, CAN_TBSLOT_TBF);
}

/**
 * @brief  Specifies time-triggered communication(TTC) timer prescaler.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8NTUPrescaler         Time-triggered communication timer prescaler.
 *                                      This parameter can be a value of @ref CAN_TTC_NTU_Prescaler
 *   @arg  CAN_TTC_NTU_PRESC_1:         NTU is SBT bit time * 1.
 *   @arg  CAN_TTC_NTU_PRESC_2:         NTU is SBT bit time * 2.
 *   @arg  CAN_TTC_NTU_PRESC_4:         NTU is SBT bit time * 4.
 *   @arg  CAN_TTC_NTU_PRESC_8:         NTU is SBT bit time * 8.
 * @retval None
 */
void CAN_TTC_SetNTUPrescaler(M4_CAN_TypeDef *CANx, uint8_t u8NTUPrescaler)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TTC_NTU_PRESC(u8NTUPrescaler));
    MODIFY_REG8(CANx->TTCFG, CAN_TTCFG_T_PRESC, u8NTUPrescaler);
}

/**
 * @brief  Enable or disable the specified interrupts of time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8IntType              Interrupt type of TTC.
 *                                      This parameter can be values of @ref CAN_TTC_Interrupt_Type
 *   @arg  CAN_TTC_INT_TTI:             Time trigger interrupt.
 *   @arg  CAN_TTC_INT_WTI:             Watch trigger interrupt.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg  Enable:                      Enable the specified interrupts.
 *   @arg  Disable:                     Disable the specified interrupts.
 * @retval None
 */
void CAN_TTC_IntCmd(M4_CAN_TypeDef *CANx, uint8_t u8IntType, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u8IntType &= CAN_TTC_INT_ALL;
    if (enNewState == Enable)
    {
        SET_REG8_BIT(CANx->TTCFG, u8IntType);
    }
    else
    {
        CLEAR_REG8_BIT(CANx->TTCFG, u8IntType);
    }
}

/**
 * @brief  Get flag status of time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8Flag                 Status flag of TTC.
 *                                      This parameter can be values of @ref CAN_TTC_Status_Flag
 *   @arg  CAN_TTC_FLAG_TTI:            Time trigger interrupt flag.
 *   @arg  CAN_TTC_FLAG_TEI:            Trigger error interrupt flag.
 *   @arg  CAN_TTC_FLAG_WTI:            Watch trigger interrupt flag.
 * @retval An en_flag_status_t enumeration type value.
 *   @arg  Set:                         At least one of the specified flags is set.
 *   @arg  Reset:                       None of the specified flags is reset.
 */
en_flag_status_t CAN_TTC_GetStatus(const M4_CAN_TypeDef *CANx, uint8_t u8Flag)
{
    en_flag_status_t enFlag = Reset;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    if (READ_REG8_BIT(CANx->TTCFG, (u8Flag & (uint8_t)CAN_TTC_FLAG_ALL)) != 0U)
    {
        enFlag = Set;
    }

