RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
    return enFlag;
}

/**
 * @brief  Clear flag status of time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8Flag                 Status flag of TTC.
 *                                      This parameter can be a value of @ref CAN_TTC_Status_Flag except CAN_TTC_FLAG_TEI.
 *   @arg  CAN_TTC_FLAG_TTI:            Time trigger interrupt flag.
 *   @arg  CAN_TTC_FLAG_WTI:            Watch trigger interrupt flag.
 * @retval None
 */
void CAN_TTC_ClrStatus(M4_CAN_TypeDef *CANx, uint8_t u8Flag)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    SET_REG8_BIT(CANx->TTCFG, (u8Flag & CAN_TTC_FLAG_CLR_MSK));
}

/**
 * @brief  Get the value of status of TTC.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value that includes the flowing status flags.
 *   @arg  CAN_TTC_FLAG_TTI:            Time trigger interrupt flag.
 *   @arg  CAN_TTC_FLAG_TEI:            Trigger error interrupt flag.
 *   @arg  CAN_TTC_FLAG_WTI:            Watch trigger interrupt flag.
 */
uint8_t CAN_TTC_GetStatusVal(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return READ_REG8_BIT(CANx->TTCFG, CAN_TTC_FLAG_ALL);
}

/**
 * @brief  Specifies reference message ID and IDE for time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u32ID                  Reference message ID.
 * @retval None
 */
void CAN_TTC_SetRefMsgID(M4_CAN_TypeDef *CANx, uint32_t u32ID)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    u32ID &= (uint32_t)(~CAN_REF_MSG_REF_IDE);
    MODIFY_REG32(CANx->REF_MSG, CAN_REF_MSG_REF_ID, u32ID);
}

/**
 * @brief  Specifiy IDE of TTC(time-triggered communication) reference message.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u32IDE                 IDE bit.
 *   @arg  0:                           Standard ID.
 *   @arg  1:                           Extended ID.
 * @retval None
 */
void CAN_TTC_SetRefMsgIDE(M4_CAN_TypeDef *CANx, uint32_t u32IDE)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_IDE(u32IDE));
    u32Addr = (uint32_t)&CANx->REF_MSG;
    BIT_BAND(u32Addr, CAN_REF_MSG_REF_IDE_POS) = u32IDE;
}

/**
 * @brief  Get reference message ID of time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint32_t value of reference message ID.
 */
uint32_t CAN_TTC_GetRefMsgID(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (READ_REG32_BIT(CANx->REF_MSG, CAN_REF_MSG_REF_ID));
}

/**
 * @brief  Get reference message ID extension bit of time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint32_t value of reference message IDE.
 *   @arg  0:                           Standard ID.
 *   @arg  1:                           Extended ID.
 */
uint32_t CAN_TTC_GetRefMsgIDE(const M4_CAN_TypeDef *CANx)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_CAN_UNIT(CANx));
    u32Addr = (uint32_t)&CANx->REF_MSG;
    return BIT_BAND(u32Addr, CAN_REF_MSG_REF_IDE_POS);
}

/**
 * @brief  Specifies transmit-trigger transmit buffer slot(TBS) for time-triggered communication(TTC) of specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u8TBSlotPtr            Transmit-trigger transmit buffer slot.
 *                                      This parameter can be a value of @ref CAN_TTC_TBS_Pointer
 *   @arg  CAN_TTC_TBS_PTB:             TBS pointer points to PTB.
 *   @arg  CAN_TTC_TBS_STB_S1:          TBS pointer points to STB slot 1.
 *   @arg  CAN_TTC_TBS_STB_S2:          TBS pointer points to STB slot 2.
 *   @arg  CAN_TTC_TBS_STB_S3:          TBS pointer points to STB slot 3.
 * @retval None
 */
void CAN_TTC_SetTxTrigTBS(M4_CAN_TypeDef *CANx, uint8_t u8TBSlotPtr)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TTC_TBS(u8TBSlotPtr));
    MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TTPTR, u8TBSlotPtr);
}

/**
 * @brief  Get transmit-trigger transmit buffer slot(TBS) of specified CAN unit's time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint8_t type value of transmit buffer slot pointer. It is can be a value of @ref CAN_TTC_TBS_Pointer
 *   @arg  CAN_TTC_TBS_PTB:             TBS pointer points to PTB.
 *   @arg  CAN_TTC_TBS_STB1:            TBS pointer points to STB slot 1.
 *   @arg  CAN_TTC_TBS_STB2:            TBS pointer points to STB slot 2.
 *   @arg  CAN_TTC_TBS_STB3:            TBS pointer points to STB slot 3.
 */
uint8_t CAN_TTC_GetTxTrigTBS(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (uint8_t)(READ_REG16_BIT(CANx->TRG_CFG, CAN_TRG_CFG_TTPTR));
}

/**
 * @brief  Specifies trigger type for time-triggered communication(TTC) of specified CAN unit.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u16TrigType            Time-triggered communication trigger type.
 *                                      This parameter can be a value of @ref CAN_TTC_Trigger_Type
 *   @arg  CAN_TTC_TRIG_IMMED_TRIG:          Immediate trigger for immediate transmission.
 *   @arg  CAN_TTC_TRIG_TIME_TRIG:           Time trigger for receive triggers.
 *   @arg  CAN_TTC_TRIG_SSHOT_TRANS_TRIG:    Single shot transmit trigger for exclusive time windows.
 *   @arg  CAN_TTC_TRIG_TRANS_START_TRIG:    Transmit start trigger for merged arbitrating time windows.
 *   @arg  CAN_TTC_TRIG_TRANS_STOP_TRIG:     Transmit stop trigger for merged arbitrating time windows.
 * @retval None
 */
void CAN_TTC_SetTrigType(M4_CAN_TypeDef *CANx, uint16_t u16TrigType)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TTC_TRIG_TYPE(u16TrigType));
    MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TTYPE, u16TrigType);
}

/**
 * @brief  Get trigger type of specified CAN unit's time-triggered communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint16_t type value of TTC trigger type.
 *   @arg  CAN_TTC_TRIG_IMMED_TRIG:          Immediate trigger for immediate transmission.
 *   @arg  CAN_TTC_TRIG_TIME_TRIG:           Time trigger for receive triggers.
 *   @arg  CAN_TTC_TRIG_SSHOT_TRANS_TRIG:    Single shot transmit trigger for exclusive time windows.
 *   @arg  CAN_TTC_TRIG_TRANS_START_TRIG:    Transmit start trigger for merged arbitrating time windows.
 *   @arg  CAN_TTC_TRIG_TRANS_STOP_TRIG:     Transmit stop trigger for merged arbitrating time windows.
 */
uint16_t CAN_TTC_GetTrigType(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return READ_REG16_BIT(CANx->TRG_CFG, CAN_TRG_CFG_TTYPE);
}

/**
 * @brief  Specifies transmission enable window for single shot transmit trigger.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u16TxEnableWindow      Number of NTU. Time period within which the transmission of a message may be started.
 * @retval None
 */
void CAN_TTC_SetTxEnableWindow(M4_CAN_TypeDef *CANx, uint16_t u16TxEnableWindow)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    DDL_ASSERT(IS_CAN_TTC_TX_EN_WINDOW(u16TxEnableWindow));
    u16TxEnableWindow -= 1U;
    u16TxEnableWindow  = (uint16_t)((uint32_t)u16TxEnableWindow << CAN_TRG_CFG_TEW_POS);
    MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TEW, u16TxEnableWindow);
}

/**
 * @brief  Get transmit enable window of single shot transmit trigger.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint16_t type value of Tx_Enable window.
 */
uint16_t CAN_TTC_GetTxEnableWindow(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return ((CANx->TRG_CFG >> CAN_TRG_CFG_TEW_POS) + 1U);
}

/**
 * @brief  Set transmission trigger time for timer-trigger communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u16TxTrigTime          Transmission trigger time. Number of NTU.
 * @retval None
 */
void CAN_TTC_SetTxTrigTime(M4_CAN_TypeDef *CANx, uint16_t u16TxTrigTime)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    WRITE_REG16(CANx->TT_TRIG, u16TxTrigTime);
}

/**
 * @brief  Get watch trigger time of timer-trigger communication(TTC).
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint16_t type value of cycle time.
 */
uint16_t CAN_TTC_GetTxTrigTime(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (CANx->TT_TRIG);
}

/**
 * @brief  Set cycle time for timer-trigger communication(TTC) watch-trigger.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  u16WatchTrigTime       Watch trigger time. Number of NTU.
 * @retval None
 */
void CAN_TTC_SetWatchTrigTime(M4_CAN_TypeDef *CANx, uint16_t u16WatchTrigTime)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    WRITE_REG16(CANx->TT_WTRIG, u16WatchTrigTime);
}

/**
 * @brief  Get cycle time of timer-trigger communication(TTC) watch-trigger.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @retval An uint16_t type value of cycle time.
 */
uint16_t CAN_TTC_GetWatchTrigTime(const M4_CAN_TypeDef *CANx)
{
    DDL_ASSERT(IS_CAN_UNIT(CANx));
    return (CANx->TT_WTRIG);
}

/**
 * @brief  CAN bus transmits data.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcTx                 Points to a stc_can_tx_t structure type data which stores the frames to be transmitted.
 * @param  [in]  u8TxBufType            CAN transmit buffer type.
 *                                      This parameter can be a value of @ref CAN_Transmit_Buffer_Type
 *   @arg  CAN_BUF_PTB:                 Primary transmit buffer.
 *   @arg  CAN_BUF_STB:                 Secondary transmit buffer.
 * @param  [in]  u8STBTxCtrl            STB transmission control. If transmit via PTB, set u8STBTxCtrl to 0.
 *                                      This parameter can be a value of @ref CAN_STB_Trans_Control
 *   @arg  CAN_STB_TRANS_ALL:           Transmit all of STB slots.
 *   @arg  CAN_STB_TRANS_ONE:           Transmit one STB slot.
 * @param  [in]  u32Timeout             Timeout value. Set it as zero for transmit in interrupt-mode.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcTx == NULL.
 *   @arg  ErrorBufferFull:             The target transmit buffer is full.
 *   @arg  ErrorOperationInProgress:    The target transmit buffer is being transmitted.
 *   @arg  ErrorAddressAlignment:       Data address is not 4-byte aligned.
 *   @arg  ErrorTimeout:                Transmit timeout.
 *   @arg  Error:                       CAN bus transmission error.
 */
en_result_t CAN_TransData(M4_CAN_TypeDef *CANx, const stc_can_tx_t *pstcTx,
                          uint8_t u8TxBufType, uint8_t u8STBTxCtrl, uint32_t u32Timeout)
{
    uint32_t i;
    uint8_t u8DataSize;
    uint8_t u8WordLen;
    uint32_t u32Addr;
    uint32_t u32TimeCnt;
    uint32_t u32SrcDataAddr;
    uint32_t u32TBAddr;
    uint8_t au8TxEn[2U][2U] = {{CAN_TCMD_TPE, CAN_TCMD_TPE}, \
                               {CAN_TCMD_TSALL, CAN_TCMD_TSONE}};
    uint8_t au8Check[2U] = {CAN_RTIF_TPIF, CAN_RTIF_TSIF};
    uint8_t au8DLC2Size[2U][16U] =
    {
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 8U, 8U, 8U, 8U, 8U, 8U, 8U},
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U},
    };
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcTx != NULL)
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));
        DDL_ASSERT(IS_CAN_TB_TYPE(u8TxBufType));
        DDL_ASSERT(IS_CAN_STB_TX_CTRL(u8STBTxCtrl));

        u32SrcDataAddr = (uint32_t)pstcTx->pu8Data;

        if ((READ_REG8_BIT(CANx->TCTRL, CAN_TB_STAT_FULL) == CAN_TB_STAT_FULL) && \
            (u8TxBufType == CAN_BUF_STB))
        {
            /* All STBs are full. */
            enRet = ErrorBufferFull;
        }
        else if ((READ_REG8_BIT(CANx->TCMD, CAN_TCMD_TPE) != 0U) && \
                 (u8TxBufType == CAN_BUF_PTB))
        {
            /* PTB is being transmitted. */
            enRet = ErrorOperationInProgress;
        }
        else if ((u32SrcDataAddr & 0x03UL) != 0U)
        {
            enRet = ErrorAddressAlignment;
        }
        else
        {
            u8DataSize = au8DLC2Size[pstcTx->FDF][pstcTx->DLC];
            u8WordLen  = u8DataSize / 4U;
            if ((u8DataSize % 4U) != 0U)
            {
                u8WordLen += 1U;
            }

            /* Specifies the transmit buffer, PTB or STB. */
            u32Addr = (uint32_t)&CANx->TCMD;
            BIT_BAND(u32Addr, CAN_TCMD_TBSEL_POS) = (uint32_t)u8TxBufType;

            u32TBAddr = (uint32_t)&CANx->TBUF;
            RW_MEM32(u32TBAddr) = pstcTx->u32ID;
            RW_MEM32(u32TBAddr + 4U) = pstcTx->u32Ctrl;

            i = 0U;
            u32TBAddr += 8U;
            while (i < u8WordLen)
            {
                RW_MEM32(u32TBAddr + i * 4U) = *(uint32_t *)u32SrcDataAddr;
                u32SrcDataAddr += 4U;
                i++;
            }

            if (u8TxBufType == CAN_BUF_STB)
            {
                /* After writes the data in transmit buffer(TB), sets the TSNEXT bit to indicate that the current \
                   STB slot has been filled, so that the hardware will point TB to the next STB slot. */
                SET_REG8_BIT(CANx->TCTRL, CAN_TCTRL_TSNEXT);
            }

            /* Enable transmission. */
            SET_REG8_BIT(CANx->TCMD, au8TxEn[u8TxBufType][u8STBTxCtrl]);

            if (u32Timeout == 0U)
            {
                enRet = Ok;
            }
            else
            {
                /* Check transmission. */
                u32TimeCnt = u32Timeout * (HCLK_VALUE / 10U / 1000U);
                enRet = ErrorTimeout;
                while (u32TimeCnt-- != 0U)
                {
                    if ((CAN_GetStatusVal(CANx) & CAN_FLAG_TX_ERR_MSK) != 0U)
                    {
                        enRet = Error;
                    }
                    else if (READ_REG8_BIT(CANx->RTIF, au8Check[u8TxBufType]) != 0U)
                    {
                        /* Clear the transmit-OK status flag. */
                        CANx->RTIF |= au8Check[u8TxBufType];
                        enRet = Ok;
                    }
                    else
                    {
                        /* rsvd */
                    }
                    if (enRet != ErrorTimeout)
                    {
                        break;
                    }
                }
            }
        }
    }

    return enRet;
}

/**
 * @brief  TTCAN transmits data. For single shot transmit trigger.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [in]  pstcTx                 Points to a stc_can_tx_t structure type data which stores the frames to be transmitted.
 * @param  [in]  u8TBSlot               Transmit buffer pointer.
 *                                      This parameter can be a value of @ref CAN_TTC_TBS_Pointer
 *   @arg  CAN_TTC_TBS_PTB:             Point to PTB.
 *   @arg  CAN_TTC_TBS_STB1:            Point to STB slot 1.
 *   @arg  CAN_TTC_TBS_STB2:            Point to STB slot 2.
 *   @arg  CAN_TTC_TBS_STB3:            Point to STB slot 3.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:       pstcTx == NULL.
 *   @arg  ErrorBufferFull:             The target transmit buffer is full.
 *   @arg  ErrorAddressAlignment:       Data address is not 4-byte aligned.
 */
en_result_t CAN_TTC_TransData(M4_CAN_TypeDef *CANx, const stc_can_tx_t *pstcTx, uint8_t u8TBSlot)
{
    uint32_t i;
    uint8_t u8Tmp;
    uint8_t u8DataSize;
    uint8_t u8WordLen;
    uint32_t u32SrcDataAddr;
    uint32_t u32TBAddr;
    uint8_t au8DLC2Size[2U][16U] =
    {
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 8U, 8U, 8U, 8U, 8U, 8U, 8U},
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U},
    };
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcTx != NULL)
    {
        DDL_ASSERT(IS_CAN_UNIT(CANx));

        u32SrcDataAddr = (uint32_t)pstcTx->pu8Data;
        u8Tmp = CANx->TBSLOT;
        WRITE_REG8(CANx->TBSLOT, u8TBSlot);
        if (READ_REG8_BIT(CANx->TCTRL, CAN_TB_STAT_FULL) == CAN_TB_STAT_FULL)
        {
            enRet = ErrorBufferFull;
        }
        else if (READ_REG8_BIT(CANx->RTIE, CAN_RTIE_TSFF) != 0U)
        {
            WRITE_REG8(CANx->TBSLOT, CAN_TBSLOT_TBF|u8Tmp);
            WRITE_REG16(CANx->TT_TRIG, CANx->TT_TRIG);
            enRet = ErrorBufferFull;
        }
        else if ((u32SrcDataAddr & 0x03UL) != 0U)
        {
            enRet = ErrorAddressAlignment;
        }
        else
        {
            u8DataSize = au8DLC2Size[pstcTx->FDF][pstcTx->DLC];
            u8WordLen  = u8DataSize / 4U;
            if ((u8DataSize % 4U) != 0U)
            {
                u8WordLen += 1U;
            }

            u32TBAddr = (uint32_t)&CANx->TBUF;
            MODIFY_REG16(CANx->TRG_CFG, CAN_TRG_CFG_TTPTR, u8TBSlot);

            RW_MEM32(u32TBAddr) = pstcTx->u32ID;
            RW_MEM32(u32TBAddr + 4U) = pstcTx->u32Ctrl;

            i = 0U;
            u32TBAddr += 8U;
            while (i < u8WordLen)
            {
                RW_MEM32(u32TBAddr + i * 4U) = *(uint32_t *)u32SrcDataAddr;
                u32SrcDataAddr += 4U;
                i++;
            }
            /* Set buffer as filled. */
            SET_REG8_BIT(CANx->TBSLOT, CAN_TBSLOT_TBF);

            /* Write MSB of TT_TRIG to transmit. */
            WRITE_REG16(CANx->TT_TRIG, CANx->TT_TRIG);

