RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_can.c
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 * @brief  CAN bus receives data.
 * @param  [in]  CANx                   Pointer to CAN instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_CAN1:                     CAN unit 1 instance register base.
 *   @arg  M4_CAN2:                     CAN unit 2 instance register base.
 * @param  [out] pstcRx                 Points to a stc_can_rx_t structure type array which is used to \
 *                                      store the received frames.
 * @param  [out] pu8RxFrameCnt          Address to store the number of frames received.
 *                                      If you do not need it, set it as NULL.\
 * @param  [in] u8RxFrameBufLength      The length of the buffer which is used to store the received frames.
 * @retval An en_result_t enumeration type value.
 *   @arg  Ok:                          No error occurred.
 *   @arg  ErrorInvalidParameter:      -pstcRx == NULL.
 *                                     -u8RxFrameBufLength == 0U.
 */
en_result_t CAN_ReceiveData(M4_CAN_TypeDef *CANx, stc_can_rx_t pstcRx[], uint8_t *pu8RxFrameCnt, uint8_t u8RxFrameBufLength)
{
    uint32_t i;
    uint8_t u8DataSize;
    uint8_t u8WordLen;
    uint8_t u8RxFrameCnt = 0U;
    uint32_t u32DestDataAddr;
    uint32_t u32RBAddr;
    en_result_t enRet;
    uint8_t au8DLC2Size[2U][16U] =
    {
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 8U, 8U, 8U, 8U, 8U, 8U, 8U},
        {0U, 1U, 2U, 3U, 4U, 5U, 6U, 7U, 8U, 12U, 16U, 20U, 24U, 32U, 48U, 64U},
    };

    if ((pstcRx == NULL) || (u8RxFrameBufLength == 0U))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        enRet = Ok;
        while (READ_REG8_BIT(CANx->RCTRL, CAN_RCTRL_RSTAT) != CAN_RB_STAT_EMPTY)
        {
            u32RBAddr = (uint32_t)&CANx->RBUF;
            pstcRx[u8RxFrameCnt].u32ID   = RW_MEM32(u32RBAddr);
            pstcRx[u8RxFrameCnt].u32Ctrl = RW_MEM32(u32RBAddr + 4U);

            u8DataSize = au8DLC2Size[pstcRx[u8RxFrameCnt].FDF][pstcRx[u8RxFrameCnt].DLC];
            u8WordLen  = u8DataSize / 4U;
            if ((u8DataSize % 4U) != 0U)
            {
                u8WordLen += 1U;
            }

            u32DestDataAddr = (uint32_t)pstcRx[u8RxFrameCnt].pu8Data;
            if (!IS_ADDRESS_ALIGN_WORD(u32DestDataAddr))
            {
                enRet = ErrorAddressAlignment;
                break;
            }
            i = 0U;
            u32RBAddr += 8U;
            while (i < u8WordLen)
            {
                *(uint32_t *)u32DestDataAddr = RW_MEM32(u32RBAddr + i * 4U);
                u32DestDataAddr += 4U;
                i++;
            }

            /* Set RB to point to the next RB slot. */
            SET_REG8_BIT(CANx->RCTRL, CAN_RCTRL_RREL);
            u8RxFrameCnt++;
            if (u8RxFrameCnt >= u8RxFrameBufLength)
            {
                break;
            }
        }

        if (pu8RxFrameCnt != NULL)
        {
            *pu8RxFrameCnt = u8RxFrameCnt;
        }
    }

    return enRet;
}

/**
 * @}
 */

#endif /* DDL_CAN_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
